app/controllers/api/v1/price_alerts_controller.rb

      def index
        @price_alerts = PriceAlert.all
---
SELECT `price_alerts`.* FROM `price_alerts`